Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel
Interaction logic for DirectionPanel.xaml
DirectionPanel

Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel.angle
The angle.

Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel.visibleInputDirections
The visible input directions

Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel class.

Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel.PropertyChanged
Occurs when a property value changes.

Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel.Angle
Gets or sets the angle.

Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel.Direction
Gets or sets the direction.

Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel.VisibleInputDirections
Gets or sets the visible input directions.

Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel.OnPropertyChanged(System.String)
Called when the property changed.
propertyName: Name of the property.

Tekla.Structures.DirectManipulation.Adapter.Controls.Custom.DirectionPanel.InitializeComponent
InitializeComponent